package TasksForMiddleCourse;
/*5 задание
Условие
Ограничение времени
1 секунда
Ограничение памяти
256 МБ
Вдохновившись исполнителями, получившими популярность анонимно исключительно в интернете, девочка Олеся решила начать музыкальную карьеру и делать песни для геймеров.

Плейлист в приложении Enchanted Mango состоит из ﻿HH﻿ дорожек, gронумерованных сверху вниз, каждая дорожка вмещает ﻿WW﻿ тактов. У Олеси есть ﻿nn﻿ семплов, которые она хотела бы разместить в плейлисте. Чтобы получился хит, она придерживается следующего правила: очередной семпл нужно размещать в самой высокой дорожке, где для него еще осталось место, а внутри дорожки он должен находиться как можно левее. Каждый семпл занимает одну дорожку, длина ﻿ii﻿-го семпла в тактах равна ﻿w_iw
i
​
 ﻿. Может так получиться, что некоторые семплы (не обязательно последние) не удастся разместить на плейлисте, тогда Олеся их просто пропускает.

Помогите будущей звезде ﻿-−﻿ для каждого семпла сообщите номер дорожки, в которой он будет размещен, либо, что данный семпл разместить на плейлисте нельзя.



Формат входных данных

В первой строке входных данных записаны три целых числа ﻿H, WH,W﻿ и ﻿n(1\leqslant H,W \leqslant 10^9, 1\leqslant n\leqslant 200000) - n(1⩽H,W⩽10
9
 ,1⩽n⩽200000)−﻿ число дорожек, число тактов и количество семплов, соответственно.

В ﻿ii﻿-й из следующих ﻿nn﻿ строк записано единственное целое число ﻿w_i(1\leqslant w_i \leqslant10^9)-w
i
​
 (1⩽w
i
​
 ⩽10
9
 )−﻿ длина ﻿ii﻿-го семпла в тактах.



Формат выходных данных

Для каждого семпла выведите единственное число ﻿r_i - r
i
​
 −﻿ номер дорожки, в которой он расположен, либо -1, если семпл разместить нельзя.



Замечание

Второй семпл будет размещен во второй дорожке, так как его длина 4, а в первой дорожке осталось всего 3 такта. Пятый семпл разместить не удастся нигде.





Примеры данных
Пример 1
3 5 5
2
4
3
3
3
1
2
1
3
-1
Решение
Тестирование происходи*/
public class Test5 {
}
